[Killed] ConditionalExpression
src/01-the-longest-word/the-longest-word.js:2:7
 const getLongestWord = (aString) => {
-  if (typeof aString !== 'string') {
+  if (true) {
     throw new TypeError('getLongestWord should receive a string as argument')
   }
killedBy: Happy Path getLongestWord(É proibido dançar agarrado mas se quiser, pode) should return "proibido"
statusReason: TypeError: getLongestWord should receive a string as argument
