[Timeout] BlockStatement
src/01-the-longest-word/the-longest-word.js:1:37
-const getLongestWord = (aString) => {
-  if (typeof aString !== 'string') {
-    throw new TypeError('getLongestWord should receive a string as argument')
-  }
-
-  return !/\s/g.test(aString)
-    ? 'The passed string should have two or more words'
-    : aString
-        .split(/[\s,:;.?!()"']/gm)
-        .reduce((acc, curr) => acc.length >= curr.length ? acc : curr, '')
-}
+const getLongestWord = (aString) => {}
 
 export default getLongestWord

[Timeout] ConditionalExpression
src/01-the-longest-word/the-longest-word.js:2:7
 const getLongestWord = (aString) => {
-  if (typeof aString !== 'string') {
+  if (false) {
     throw new TypeError('getLongestWord should receive a string as argument')
   }

[Timeout] EqualityOperator
src/01-the-longest-word/the-longest-word.js:2:7
 const getLongestWord = (aString) => {
-  if (typeof aString !== 'string') {
+  if (typeof aString === 'string') {
     throw new TypeError('getLongestWord should receive a string as argument')
   }

[Timeout] StringLiteral
src/01-the-longest-word/the-longest-word.js:3:25
 const getLongestWord = (aString) => {
   if (typeof aString !== 'string') {
-    throw new TypeError('getLongestWord should receive a string as argument')
+    throw new TypeError("")
   }
 

[Timeout] BooleanLiteral
src/01-the-longest-word/the-longest-word.js:6:10
     throw new TypeError('getLongestWord should receive a string as argument')
   }
 
-  return !/\s/g.test(aString)
+  return /\s/g.test(aString)
     ? 'The passed string should have two or more words'
     : aString

[Timeout] Regex
src/01-the-longest-word/the-longest-word.js:6:11
     throw new TypeError('getLongestWord should receive a string as argument')
   }
 
-  return !/\s/g.test(aString)
+  return !/\S/g.test(aString)
     ? 'The passed string should have two or more words'
     : aString

[Timeout] Regex
src/01-the-longest-word/the-longest-word.js:9:16
   return !/\s/g.test(aString)
     ? 'The passed string should have two or more words'
     : aString
-        .split(/[\s,:;.?!()"']/gm)
+        .split(/[\S,:;.?!()"']/gm)
         .reduce((acc, curr) => acc.length >= curr.length ? acc : curr, '')
 }

[Timeout] ArrowFunction
src/01-the-longest-word/the-longest-word.js:10:17
     ? 'The passed string should have two or more words'
     : aString
         .split(/[\s,:;.?!()"']/gm)
-        .reduce((acc, curr) => acc.length >= curr.length ? acc : curr, '')
+        .reduce(() => undefined, '')
 }
 

[Timeout] ConditionalExpression
src/01-the-longest-word/the-longest-word.js:10:32
     ? 'The passed string should have two or more words'
     : aString
         .split(/[\s,:;.?!()"']/gm)
-        .reduce((acc, curr) => acc.length >= curr.length ? acc : curr, '')
+        .reduce((acc, curr) => true ? acc : curr, '')
 }
 
