[Timeout] BlockStatement
src/02-factorial/factorial.js:3:29
 import errorMessage from './utils/error-message'
 
-const getFactorial = num => {
-  if (typeof num !== 'number') {
-    throw new TypeError(errorMessage)
-  }
-
-  const firstNumbers = [ 0, 1 ]
-  return firstNumbers.includes(num)
-    ? 1
-    : num * getFactorial(num - 1)
-}
+const getFactorial = num => {}
 
 export default getFactorial

[Timeout] ConditionalExpression
src/02-factorial/factorial.js:4:7
 import errorMessage from './utils/error-message'
 
 const getFactorial = num => {
-  if (typeof num !== 'number') {
+  if (true) {
     throw new TypeError(errorMessage)
   }

[Timeout] ConditionalExpression
src/02-factorial/factorial.js:4:7
 import errorMessage from './utils/error-message'
 
 const getFactorial = num => {
-  if (typeof num !== 'number') {
+  if (false) {
     throw new TypeError(errorMessage)
   }

[Timeout] ArrayDeclaration
src/02-factorial/factorial.js:8:24
     throw new TypeError(errorMessage)
   }
 
-  const firstNumbers = [ 0, 1 ]
+  const firstNumbers = []
   return firstNumbers.includes(num)
     ? 1

[Timeout] ArithmeticOperator
src/02-factorial/factorial.js:11:26
   const firstNumbers = [ 0, 1 ]
   return firstNumbers.includes(num)
     ? 1
-    : num * getFactorial(num - 1)
+    : num * getFactorial(num + 1)
 }
 

[Timeout] ArithmeticOperator
src/02-factorial/factorial.js:11:7
   const firstNumbers = [ 0, 1 ]
   return firstNumbers.includes(num)
     ? 1
-    : num * getFactorial(num - 1)
+    : num / getFactorial(num - 1)
 }
 
